{
  "nodes": [
    {
      "op": "null", 
      "name": "input", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_pad_layout_transform_layout_transform", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_pad_layout_transform_layout_transform", 
        "src_layout": "NCHW", 
        "dst_layout": "NCHW3c", 
        "hash": "601c36cf0fd263b0"
      }, 
      "inputs": [
        [
          0, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p0", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p1", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p2", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p3", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p4", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_subtract_divide_multiply_add_multiply_maximum", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "6", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_subtract_divide_multiply_add_multiply_maximum", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW3i4o", 
        "data_layout": "NCHW3c", 
        "hash": "b35a3f47f2360294"
      }, 
      "inputs": [
        [
          1, 
          0, 
          0
        ], 
        [
          2, 
          0, 
          0
        ], 
        [
          3, 
          0, 
          0
        ], 
        [
          4, 
          0, 
          0
        ], 
        [
          5, 
          0, 
          0
        ], 
        [
          6, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_max_pool2d", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_max_pool2d", 
        "out_layout": "", 
        "layout": "NCHW4c", 
        "hash": "86a909129a5a8fd2"
      }, 
      "inputs": [
        [
          7, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_pad", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_pad", 
        "hash": "9a782f736ee86f15"
      }, 
      "inputs": [
        [
          8, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p5", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p6", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p7", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p8", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p9", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_subtract_divide_multiply_add_multiply_maximum_1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "6", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_subtract_divide_multiply_add_multiply_maximum_1", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "hash": "20f120f2d7744d11"
      }, 
      "inputs": [
        [
          9, 
          0, 
          0
        ], 
        [
          10, 
          0, 
          0
        ], 
        [
          11, 
          0, 
          0
        ], 
        [
          12, 
          0, 
          0
        ], 
        [
          13, 
          0, 
          0
        ], 
        [
          14, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_max_pool2d_1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_max_pool2d_1", 
        "out_layout": "", 
        "layout": "NCHW4c", 
        "hash": "34be699a76f3dc26"
      }, 
      "inputs": [
        [
          15, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_pad_1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_pad_1", 
        "hash": "cefa5d45883d2745"
      }, 
      "inputs": [
        [
          16, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p10", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p11", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p12", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p13", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p14", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_subtract_divide_multiply_add_multiply_maximum_2", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "6", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_subtract_divide_multiply_add_multiply_maximum_2", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "hash": "f91f8c262ae3ba26"
      }, 
      "inputs": [
        [
          17, 
          0, 
          0
        ], 
        [
          18, 
          0, 
          0
        ], 
        [
          19, 
          0, 
          0
        ], 
        [
          20, 
          0, 
          0
        ], 
        [
          21, 
          0, 
          0
        ], 
        [
          22, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_max_pool2d_2", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_max_pool2d_2", 
        "out_layout": "", 
        "layout": "NCHW4c", 
        "hash": "ee8c883fdf6e0be5"
      }, 
      "inputs": [
        [
          23, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_pad_2", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_pad_2", 
        "hash": "5ac2f93c919d5b75"
      }, 
      "inputs": [
        [
          24, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p15", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p16", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p17", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p18", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p19", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_subtract_divide_multiply_add_multiply_maximum_3", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "6", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_subtract_divide_multiply_add_multiply_maximum_3", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "hash": "dc8904bea4f03c16"
      }, 
      "inputs": [
        [
          25, 
          0, 
          0
        ], 
        [
          26, 
          0, 
          0
        ], 
        [
          27, 
          0, 
          0
        ], 
        [
          28, 
          0, 
          0
        ], 
        [
          29, 
          0, 
          0
        ], 
        [
          30, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_max_pool2d_3", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_max_pool2d_3", 
        "out_layout": "", 
        "layout": "NCHW4c", 
        "hash": "947f990495fec935"
      }, 
      "inputs": [
        [
          31, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_pad_3", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_pad_3", 
        "hash": "9eee3aa5989d4aa7"
      }, 
      "inputs": [
        [
          32, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p20", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p21", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p22", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p23", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p24", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_subtract_divide_multiply_add_multiply_maximum_4", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "6", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_subtract_divide_multiply_add_multiply_maximum_4", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "hash": "37f0b0d1a067cafe"
      }, 
      "inputs": [
        [
          33, 
          0, 
          0
        ], 
        [
          34, 
          0, 
          0
        ], 
        [
          35, 
          0, 
          0
        ], 
        [
          36, 
          0, 
          0
        ], 
        [
          37, 
          0, 
          0
        ], 
        [
          38, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_max_pool2d_4", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_max_pool2d_4", 
        "out_layout": "", 
        "layout": "NCHW4c", 
        "hash": "2bf1e5a02cde2bac"
      }, 
      "inputs": [
        [
          39, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_pad_4", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_pad_4", 
        "hash": "04aa08289a5b196b"
      }, 
      "inputs": [
        [
          40, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p25", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p26", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p27", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p28", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p29", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_subtract_divide_multiply_add_multiply_maximum_5", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "6", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_subtract_divide_multiply_add_multiply_maximum_5", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "hash": "bb0366cbb9f684e6"
      }, 
      "inputs": [
        [
          41, 
          0, 
          0
        ], 
        [
          42, 
          0, 
          0
        ], 
        [
          43, 
          0, 
          0
        ], 
        [
          44, 
          0, 
          0
        ], 
        [
          45, 
          0, 
          0
        ], 
        [
          46, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_max_pool2d_5", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_max_pool2d_5", 
        "out_layout": "", 
        "layout": "NCHW4c", 
        "hash": "df65af37c3d6695c"
      }, 
      "inputs": [
        [
          47, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_pad_5", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_pad_5", 
        "hash": "1b907a5133ff3eb0"
      }, 
      "inputs": [
        [
          48, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p30", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p31", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p32", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p33", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p34", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_subtract_divide_multiply_add_multiply_maximum_6", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "6", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_subtract_divide_multiply_add_multiply_maximum_6", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "hash": "c8c8c123a8ade204"
      }, 
      "inputs": [
        [
          49, 
          0, 
          0
        ], 
        [
          50, 
          0, 
          0
        ], 
        [
          51, 
          0, 
          0
        ], 
        [
          52, 
          0, 
          0
        ], 
        [
          53, 
          0, 
          0
        ], 
        [
          54, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_pad_6", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_pad_6", 
        "hash": "ac8ca36d9a6efea1"
      }, 
      "inputs": [
        [
          55, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p35", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p36", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p37", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p38", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p39", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_subtract_divide_multiply_add_multiply_maximum_7", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "6", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_subtract_divide_multiply_add_multiply_maximum_7", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "hash": "1e033ee1e7143170"
      }, 
      "inputs": [
        [
          56, 
          0, 
          0
        ], 
        [
          57, 
          0, 
          0
        ], 
        [
          58, 
          0, 
          0
        ], 
        [
          59, 
          0, 
          0
        ], 
        [
          60, 
          0, 
          0
        ], 
        [
          61, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_pad_layout_transform", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_pad_layout_transform", 
        "src_layout": "NCHW4c", 
        "dst_layout": "NCHW1c", 
        "hash": "d619004a9110562b"
      }, 
      "inputs": [
        [
          62, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p40", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p41", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add", 
        "out_layout": "NCHW1c", 
        "kernel_layout": "OIHW1i1o", 
        "data_layout": "NCHW1c", 
        "hash": "ca0ae64a1149e23b"
      }, 
      "inputs": [
        [
          63, 
          0, 
          0
        ], 
        [
          64, 
          0, 
          0
        ], 
        [
          65, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_layout_transform", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_layout_transform", 
        "src_layout": "NCHW", 
        "dst_layout": "NHWC", 
        "hash": "a5c1992067ae4324"
      }, 
      "inputs": [
        [
          66, 
          0, 
          0
        ]
      ]
    }
  ], 
  "arg_nodes": [
    0, 
    2, 
    3, 
    4, 
    5, 
    6, 
    10, 
    11, 
    12, 
    13, 
    14, 
    18, 
    19, 
    20, 
    21, 
    22, 
    26, 
    27, 
    28, 
    29, 
    30, 
    34, 
    35, 
    36, 
    37, 
    38, 
    42, 
    43, 
    44, 
    45, 
    46, 
    50, 
    51, 
    52, 
    53, 
    54, 
    57, 
    58, 
    59, 
    60, 
    61, 
    64, 
    65
  ], 
  "heads": [
    [
      67, 
      0, 
      0
    ]
  ], 
  "attrs": {
    "dltype": [
      "list_str", 
      [
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32"
      ]
    ], 
    "device_index": [
      "list_int", 
      [
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1
      ]
    ], 
    "storage_id": [
      "list_int", 
      [
        0, 
        1, 
        2, 
        3, 
        4, 
        5, 
        6, 
        7, 
        1, 
        7, 
        8, 
        9, 
        10, 
        11, 
        12, 
        1, 
        7, 
        1, 
        13, 
        14, 
        15, 
        16, 
        17, 
        7, 
        1, 
        7, 
        18, 
        19, 
        20, 
        21, 
        22, 
        1, 
        23, 
        1, 
        24, 
        25, 
        26, 
        27, 
        28, 
        7, 
        23, 
        29, 
        30, 
        31, 
        32, 
        33, 
        34, 
        23, 
        1, 
        23, 
        35, 
        36, 
        37, 
        38, 
        39, 
        1, 
        7, 
        40, 
        41, 
        42, 
        43, 
        44, 
        23, 
        1, 
        45, 
        46, 
        23, 
        29
      ]
    ], 
    "shape": [
      "list_shape", 
      [
        [1, 416, 416, 3], 
        [1, 1, 418, 418, 3], 
        [4, 1, 3, 3, 3, 4], 
        [1, 4, 1, 1, 4], 
        [1, 4, 1, 1, 4], 
        [1, 4, 1, 1, 4], 
        [1, 4, 1, 1, 4], 
        [1, 4, 416, 416, 4], 
        [1, 4, 208, 208, 4], 
        [1, 4, 210, 210, 4], 
        [8, 4, 3, 3, 4, 4], 
        [1, 8, 1, 1, 4], 
        [1, 8, 1, 1, 4], 
        [1, 8, 1, 1, 4], 
        [1, 8, 1, 1, 4], 
        [1, 8, 208, 208, 4], 
        [1, 8, 104, 104, 4], 
        [1, 8, 106, 106, 4], 
        [16, 8, 3, 3, 4, 4], 
        [1, 16, 1, 1, 4], 
        [1, 16, 1, 1, 4], 
        [1, 16, 1, 1, 4], 
        [1, 16, 1, 1, 4], 
        [1, 16, 104, 104, 4], 
        [1, 16, 52, 52, 4], 
        [1, 16, 54, 54, 4], 
        [32, 16, 3, 3, 4, 4], 
        [1, 32, 1, 1, 4], 
        [1, 32, 1, 1, 4], 
        [1, 32, 1, 1, 4], 
        [1, 32, 1, 1, 4], 
        [1, 32, 52, 52, 4], 
        [1, 32, 26, 26, 4], 
        [1, 32, 28, 28, 4], 
        [64, 32, 3, 3, 4, 4], 
        [1, 64, 1, 1, 4], 
        [1, 64, 1, 1, 4], 
        [1, 64, 1, 1, 4], 
        [1, 64, 1, 1, 4], 
        [1, 64, 26, 26, 4], 
        [1, 64, 13, 13, 4], 
        [1, 64, 15, 15, 4], 
        [128, 64, 3, 3, 4, 4], 
        [1, 128, 1, 1, 4], 
        [1, 128, 1, 1, 4], 
        [1, 128, 1, 1, 4], 
        [1, 128, 1, 1, 4], 
        [1, 128, 13, 13, 4], 
        [1, 128, 13, 13, 4], 
        [1, 128, 15, 15, 4], 
        [256, 128, 3, 3, 4, 4], 
        [1, 256, 1, 1, 4], 
        [1, 256, 1, 1, 4], 
        [1, 256, 1, 1, 4], 
        [1, 256, 1, 1, 4], 
        [1, 256, 13, 13, 4], 
        [1, 256, 15, 15, 4], 
        [128, 256, 3, 3, 4, 4], 
        [1, 128, 1, 1, 4], 
        [1, 128, 1, 1, 4], 
        [1, 128, 1, 1, 4], 
        [1, 128, 1, 1, 4], 
        [1, 128, 13, 13, 4], 
        [1, 512, 13, 13, 1], 
        [425, 512, 1, 1, 1, 1], 
        [1, 425, 1, 1, 1], 
        [1, 425, 13, 13, 1], 
        [1, 13, 13, 425]
      ]
    ]
  }, 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    21, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27, 
    28, 
    29, 
    30, 
    31, 
    32, 
    33, 
    34, 
    35, 
    36, 
    37, 
    38, 
    39, 
    40, 
    41, 
    42, 
    43, 
    44, 
    45, 
    46, 
    47, 
    48, 
    49, 
    50, 
    51, 
    52, 
    53, 
    54, 
    55, 
    56, 
    57, 
    58, 
    59, 
    60, 
    61, 
    62, 
    63, 
    64, 
    65, 
    66, 
    67, 
    68
  ]
}