{
  "nodes": [
    {
      "op": "null", 
      "name": "input.1", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform", 
        "src_layout": "NCHW", 
        "dst_layout": "NCHW3c", 
        "hash": "1268fd9913eb2ff9"
      }, 
      "inputs": [
        [
          0, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p0", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p1", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p2", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_add_nn_leaky_relu", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "4", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_add_nn_leaky_relu", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW3i4o", 
        "data_layout": "NCHW3c", 
        "hash": "c8737afc8b23d52c"
      }, 
      "inputs": [
        [
          1, 
          0, 
          0
        ], 
        [
          2, 
          0, 
          0
        ], 
        [
          3, 
          0, 
          0
        ], 
        [
          4, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p3", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p4", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p5", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_add_nn_leaky_relu_1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "4", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_add_nn_leaky_relu_1", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "hash": "7c45ad015aa53e21"
      }, 
      "inputs": [
        [
          5, 
          0, 
          0
        ], 
        [
          6, 
          0, 
          0
        ], 
        [
          7, 
          0, 
          0
        ], 
        [
          8, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p6", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p7", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p8", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_add_nn_leaky_relu_2", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "4", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_add_nn_leaky_relu_2", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "hash": "7abd10cdd02e1cf8"
      }, 
      "inputs": [
        [
          9, 
          0, 
          0
        ], 
        [
          10, 
          0, 
          0
        ], 
        [
          11, 
          0, 
          0
        ], 
        [
          12, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p9", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p10", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p11", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_add_nn_leaky_relu_3", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "4", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_add_nn_leaky_relu_3", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "hash": "992bdddbb41d62d1"
      }, 
      "inputs": [
        [
          13, 
          0, 
          0
        ], 
        [
          14, 
          0, 
          0
        ], 
        [
          15, 
          0, 
          0
        ], 
        [
          16, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p12", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p13", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p14", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_add_nn_leaky_relu_4", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "4", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_add_nn_leaky_relu_4", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "hash": "3ead087636f857bd"
      }, 
      "inputs": [
        [
          17, 
          0, 
          0
        ], 
        [
          18, 
          0, 
          0
        ], 
        [
          19, 
          0, 
          0
        ], 
        [
          20, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p15", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p16", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p17", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_add_nn_leaky_relu_5", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "4", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_add_nn_leaky_relu_5", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "hash": "2fabac2b3ea19bb4"
      }, 
      "inputs": [
        [
          21, 
          0, 
          0
        ], 
        [
          22, 
          0, 
          0
        ], 
        [
          23, 
          0, 
          0
        ], 
        [
          24, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p18", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p19", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p20", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_add_nn_leaky_relu_51", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "4", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_add_nn_leaky_relu_5", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "hash": "2fabac2b3ea19bb4"
      }, 
      "inputs": [
        [
          25, 
          0, 
          0
        ], 
        [
          26, 
          0, 
          0
        ], 
        [
          27, 
          0, 
          0
        ], 
        [
          28, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p21", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p22", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p23", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_add_nn_leaky_relu_6", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "4", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_add_nn_leaky_relu_6", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "hash": "5be885fcb9417ec6"
      }, 
      "inputs": [
        [
          29, 
          0, 
          0
        ], 
        [
          30, 
          0, 
          0
        ], 
        [
          31, 
          0, 
          0
        ], 
        [
          32, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p24", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p25", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p26", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_add_nn_leaky_relu_7", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "4", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_add_nn_leaky_relu_7", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "hash": "8b742fe284014997"
      }, 
      "inputs": [
        [
          33, 
          0, 
          0
        ], 
        [
          34, 
          0, 
          0
        ], 
        [
          35, 
          0, 
          0
        ], 
        [
          36, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p27", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p28", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p29", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_add_nn_leaky_relu_71", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "4", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_add_nn_leaky_relu_7", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "hash": "8b742fe284014997"
      }, 
      "inputs": [
        [
          37, 
          0, 
          0
        ], 
        [
          38, 
          0, 
          0
        ], 
        [
          39, 
          0, 
          0
        ], 
        [
          40, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p30", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p31", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p32", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_add_nn_leaky_relu_8", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "4", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_add_nn_leaky_relu_8", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "hash": "05394b9c5c65c8b6"
      }, 
      "inputs": [
        [
          41, 
          0, 
          0
        ], 
        [
          42, 
          0, 
          0
        ], 
        [
          43, 
          0, 
          0
        ], 
        [
          44, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p33", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p34", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p35", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_add_nn_leaky_relu_9", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "4", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_add_nn_leaky_relu_9", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "hash": "c33a56621f0fb89b"
      }, 
      "inputs": [
        [
          45, 
          0, 
          0
        ], 
        [
          46, 
          0, 
          0
        ], 
        [
          47, 
          0, 
          0
        ], 
        [
          48, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p36", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p37", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p38", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_add_nn_leaky_relu_91", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "4", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_add_nn_leaky_relu_9", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "hash": "c33a56621f0fb89b"
      }, 
      "inputs": [
        [
          49, 
          0, 
          0
        ], 
        [
          50, 
          0, 
          0
        ], 
        [
          51, 
          0, 
          0
        ], 
        [
          52, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p39", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p40", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p41", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_add_nn_leaky_relu_10", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "4", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_add_nn_leaky_relu_10", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "hash": "a8eea80affa84255"
      }, 
      "inputs": [
        [
          53, 
          0, 
          0
        ], 
        [
          54, 
          0, 
          0
        ], 
        [
          55, 
          0, 
          0
        ], 
        [
          56, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p42", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p43", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p44", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_add_nn_leaky_relu_11", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "4", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_add_nn_leaky_relu_11", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "hash": "1cf27fb185505d0f"
      }, 
      "inputs": [
        [
          57, 
          0, 
          0
        ], 
        [
          58, 
          0, 
          0
        ], 
        [
          59, 
          0, 
          0
        ], 
        [
          60, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p45", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p46", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p47", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_add_nn_leaky_relu_111", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "4", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_add_nn_leaky_relu_11", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "hash": "1cf27fb185505d0f"
      }, 
      "inputs": [
        [
          61, 
          0, 
          0
        ], 
        [
          62, 
          0, 
          0
        ], 
        [
          63, 
          0, 
          0
        ], 
        [
          64, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_1", 
        "src_layout": "NCHW4c", 
        "dst_layout": "NCHW", 
        "hash": "dff855160808da01"
      }, 
      "inputs": [
        [
          65, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p48", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p49", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p50", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p51", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_transpose_add_multiply_add_nn_leaky_relu", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "5", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_conv2d_transpose_add_multiply_add_nn_leaky_relu", 
        "out_layout": "", 
        "kernel_layout": "IOHW", 
        "data_layout": "NCHW", 
        "hash": "ae4693739679ee25"
      }, 
      "inputs": [
        [
          66, 
          0, 
          0
        ], 
        [
          67, 
          0, 
          0
        ], 
        [
          68, 
          0, 
          0
        ], 
        [
          69, 
          0, 
          0
        ], 
        [
          70, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_concatenate_layout_transform", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_concatenate_layout_transform", 
        "src_layout": "NCHW", 
        "dst_layout": "NCHW4c", 
        "hash": "158fbd57435a2613"
      }, 
      "inputs": [
        [
          53, 
          0, 
          0
        ], 
        [
          71, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p52", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p53", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p54", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_add_nn_leaky_relu_12", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "4", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_add_nn_leaky_relu_12", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "hash": "e49869a59136d85d"
      }, 
      "inputs": [
        [
          72, 
          0, 
          0
        ], 
        [
          73, 
          0, 
          0
        ], 
        [
          74, 
          0, 
          0
        ], 
        [
          75, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_2", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_2", 
        "src_layout": "NCHW4c", 
        "dst_layout": "NCHW", 
        "hash": "60699a97d0cb6231"
      }, 
      "inputs": [
        [
          76, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p55", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p56", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p57", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p58", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_transpose_add_multiply_add_nn_leaky_relu_1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "5", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_conv2d_transpose_add_multiply_add_nn_leaky_relu_1", 
        "out_layout": "", 
        "kernel_layout": "IOHW", 
        "data_layout": "NCHW", 
        "hash": "e6e72bf7af690560"
      }, 
      "inputs": [
        [
          77, 
          0, 
          0
        ], 
        [
          78, 
          0, 
          0
        ], 
        [
          79, 
          0, 
          0
        ], 
        [
          80, 
          0, 
          0
        ], 
        [
          81, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_concatenate_layout_transform_1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_concatenate_layout_transform_1", 
        "src_layout": "NCHW", 
        "dst_layout": "NCHW4c", 
        "hash": "912697598b2bf6b9"
      }, 
      "inputs": [
        [
          41, 
          0, 
          0
        ], 
        [
          82, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p59", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p60", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p61", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_add_nn_leaky_relu_13", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "4", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_add_nn_leaky_relu_13", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "hash": "d8449953f191280d"
      }, 
      "inputs": [
        [
          83, 
          0, 
          0
        ], 
        [
          84, 
          0, 
          0
        ], 
        [
          85, 
          0, 
          0
        ], 
        [
          86, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_3", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_3", 
        "src_layout": "NCHW4c", 
        "dst_layout": "NCHW", 
        "hash": "ed2378bdba8a65c7"
      }, 
      "inputs": [
        [
          87, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p62", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p63", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p64", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p65", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_transpose_add_multiply_add_nn_leaky_relu_2", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "5", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_conv2d_transpose_add_multiply_add_nn_leaky_relu_2", 
        "out_layout": "", 
        "kernel_layout": "IOHW", 
        "data_layout": "NCHW", 
        "hash": "3a3ec8319087627f"
      }, 
      "inputs": [
        [
          88, 
          0, 
          0
        ], 
        [
          89, 
          0, 
          0
        ], 
        [
          90, 
          0, 
          0
        ], 
        [
          91, 
          0, 
          0
        ], 
        [
          92, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_concatenate_layout_transform_2", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_concatenate_layout_transform_2", 
        "src_layout": "NCHW", 
        "dst_layout": "NCHW4c", 
        "hash": "a5bd0a417731fc29"
      }, 
      "inputs": [
        [
          29, 
          0, 
          0
        ], 
        [
          93, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p66", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p67", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p68", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_add_nn_leaky_relu_14", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "4", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_add_nn_leaky_relu_14", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "hash": "23005ba9b530a0bc"
      }, 
      "inputs": [
        [
          94, 
          0, 
          0
        ], 
        [
          95, 
          0, 
          0
        ], 
        [
          96, 
          0, 
          0
        ], 
        [
          97, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_4", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_4", 
        "src_layout": "NCHW4c", 
        "dst_layout": "NCHW", 
        "hash": "84ea5aa0e40bc57f"
      }, 
      "inputs": [
        [
          98, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p69", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p70", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p71", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p72", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_transpose_add_multiply_add_nn_leaky_relu_3", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "5", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_conv2d_transpose_add_multiply_add_nn_leaky_relu_3", 
        "out_layout": "", 
        "kernel_layout": "IOHW", 
        "data_layout": "NCHW", 
        "hash": "efd4e95c344b6ecf"
      }, 
      "inputs": [
        [
          99, 
          0, 
          0
        ], 
        [
          100, 
          0, 
          0
        ], 
        [
          101, 
          0, 
          0
        ], 
        [
          102, 
          0, 
          0
        ], 
        [
          103, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_concatenate_layout_transform_3", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_concatenate_layout_transform_3", 
        "src_layout": "NCHW", 
        "dst_layout": "NCHW4c", 
        "hash": "701f5cd5eb730c7f"
      }, 
      "inputs": [
        [
          17, 
          0, 
          0
        ], 
        [
          104, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p73", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p74", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p75", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_add_nn_leaky_relu_15", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "4", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_add_nn_leaky_relu_15", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "hash": "f5904deccf3e6e8a"
      }, 
      "inputs": [
        [
          105, 
          0, 
          0
        ], 
        [
          106, 
          0, 
          0
        ], 
        [
          107, 
          0, 
          0
        ], 
        [
          108, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_5", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_5", 
        "src_layout": "NCHW4c", 
        "dst_layout": "NCHW", 
        "hash": "2c7a0039de5d46c7"
      }, 
      "inputs": [
        [
          109, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p76", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p77", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_transpose_add", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_conv2d_transpose_add", 
        "out_layout": "", 
        "kernel_layout": "IOHW", 
        "data_layout": "NCHW", 
        "hash": "844ea763b42f6617"
      }, 
      "inputs": [
        [
          110, 
          0, 
          0
        ], 
        [
          111, 
          0, 
          0
        ], 
        [
          112, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_strided_slice_exp", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_strided_slice_exp", 
        "hash": "3eedb3e41407e7f6"
      }, 
      "inputs": [
        [
          113, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_sum", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_sum", 
        "hash": "e60398a3578a20f1"
      }, 
      "inputs": [
        [
          114, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_strided_slice_sigmoid_strided_slice_strided_slice_strided_slice_sigmoid_di_11419241578802661522_", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_strided_slice_sigmoid_strided_slice_strided_slice_strided_slice_sigmoid_di_11419241578802661522_", 
        "hash": "74ebd55c8535f72b"
      }, 
      "inputs": [
        [
          113, 
          0, 
          0
        ], 
        [
          114, 
          0, 
          0
        ], 
        [
          115, 
          0, 
          0
        ]
      ]
    }
  ], 
  "arg_nodes": [
    0, 
    2, 
    3, 
    4, 
    6, 
    7, 
    8, 
    10, 
    11, 
    12, 
    14, 
    15, 
    16, 
    18, 
    19, 
    20, 
    22, 
    23, 
    24, 
    26, 
    27, 
    28, 
    30, 
    31, 
    32, 
    34, 
    35, 
    36, 
    38, 
    39, 
    40, 
    42, 
    43, 
    44, 
    46, 
    47, 
    48, 
    50, 
    51, 
    52, 
    54, 
    55, 
    56, 
    58, 
    59, 
    60, 
    62, 
    63, 
    64, 
    67, 
    68, 
    69, 
    70, 
    73, 
    74, 
    75, 
    78, 
    79, 
    80, 
    81, 
    84, 
    85, 
    86, 
    89, 
    90, 
    91, 
    92, 
    95, 
    96, 
    97, 
    100, 
    101, 
    102, 
    103, 
    106, 
    107, 
    108, 
    111, 
    112
  ], 
  "heads": [
    [
      116, 
      0, 
      0
    ]
  ], 
  "attrs": {
    "dltype": [
      "list_str", 
      [
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32"
      ]
    ], 
    "device_index": [
      "list_int", 
      [
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1
      ]
    ], 
    "storage_id": [
      "list_int", 
      [
        0, 
        1, 
        2, 
        3, 
        4, 
        5, 
        6, 
        7, 
        8, 
        1, 
        9, 
        10, 
        11, 
        5, 
        12, 
        13, 
        14, 
        1, 
        15, 
        16, 
        17, 
        5, 
        18, 
        19, 
        20, 
        21, 
        22, 
        23, 
        24, 
        5, 
        25, 
        26, 
        27, 
        21, 
        28, 
        29, 
        30, 
        31, 
        32, 
        33, 
        34, 
        21, 
        35, 
        36, 
        37, 
        31, 
        38, 
        39, 
        40, 
        41, 
        42, 
        43, 
        44, 
        31, 
        45, 
        46, 
        47, 
        41, 
        48, 
        49, 
        50, 
        51, 
        52, 
        53, 
        54, 
        41, 
        51, 
        55, 
        56, 
        57, 
        58, 
        41, 
        51, 
        59, 
        60, 
        61, 
        41, 
        51, 
        62, 
        63, 
        64, 
        65, 
        31, 
        51, 
        66, 
        67, 
        68, 
        31, 
        51, 
        69, 
        70, 
        71, 
        72, 
        21, 
        51, 
        73, 
        74, 
        75, 
        21, 
        51, 
        76, 
        77, 
        78, 
        79, 
        5, 
        51, 
        80, 
        81, 
        82, 
        1, 
        5, 
        83, 
        84, 
        51, 
        1, 
        31, 
        5
      ]
    ], 
    "shape": [
      "list_shape", 
      [
        [1, 6, 672, 672], 
        [1, 2, 672, 672, 3], 
        [6, 2, 1, 1, 3, 4], 
        [1, 6, 1, 1, 4], 
        [1, 6, 1, 1, 4], 
        [1, 6, 672, 672, 4], 
        [6, 6, 3, 3, 4, 4], 
        [1, 6, 1, 1, 4], 
        [1, 6, 1, 1, 4], 
        [1, 6, 672, 672, 4], 
        [12, 6, 3, 3, 4, 4], 
        [1, 12, 1, 1, 4], 
        [1, 12, 1, 1, 4], 
        [1, 12, 336, 336, 4], 
        [12, 12, 3, 3, 4, 4], 
        [1, 12, 1, 1, 4], 
        [1, 12, 1, 1, 4], 
        [1, 12, 336, 336, 4], 
        [16, 12, 3, 3, 4, 4], 
        [1, 16, 1, 1, 4], 
        [1, 16, 1, 1, 4], 
        [1, 16, 168, 168, 4], 
        [16, 16, 3, 3, 4, 4], 
        [1, 16, 1, 1, 4], 
        [1, 16, 1, 1, 4], 
        [1, 16, 168, 168, 4], 
        [16, 16, 3, 3, 4, 4], 
        [1, 16, 1, 1, 4], 
        [1, 16, 1, 1, 4], 
        [1, 16, 168, 168, 4], 
        [24, 16, 3, 3, 4, 4], 
        [1, 24, 1, 1, 4], 
        [1, 24, 1, 1, 4], 
        [1, 24, 84, 84, 4], 
        [24, 24, 3, 3, 4, 4], 
        [1, 24, 1, 1, 4], 
        [1, 24, 1, 1, 4], 
        [1, 24, 84, 84, 4], 
        [24, 24, 3, 3, 4, 4], 
        [1, 24, 1, 1, 4], 
        [1, 24, 1, 1, 4], 
        [1, 24, 84, 84, 4], 
        [32, 24, 3, 3, 4, 4], 
        [1, 32, 1, 1, 4], 
        [1, 32, 1, 1, 4], 
        [1, 32, 42, 42, 4], 
        [32, 32, 3, 3, 4, 4], 
        [1, 32, 1, 1, 4], 
        [1, 32, 1, 1, 4], 
        [1, 32, 42, 42, 4], 
        [32, 32, 3, 3, 4, 4], 
        [1, 32, 1, 1, 4], 
        [1, 32, 1, 1, 4], 
        [1, 32, 42, 42, 4], 
        [48, 32, 3, 3, 4, 4], 
        [1, 48, 1, 1, 4], 
        [1, 48, 1, 1, 4], 
        [1, 48, 21, 21, 4], 
        [48, 48, 3, 3, 4, 4], 
        [1, 48, 1, 1, 4], 
        [1, 48, 1, 1, 4], 
        [1, 48, 21, 21, 4], 
        [48, 48, 3, 3, 4, 4], 
        [1, 48, 1, 1, 4], 
        [1, 48, 1, 1, 4], 
        [1, 48, 21, 21, 4], 
        [1, 192, 21, 21], 
        [192, 128, 4, 4], 
        [1, 128, 1, 1], 
        [1, 128, 1, 1], 
        [1, 128, 1, 1], 
        [1, 128, 42, 42], 
        [1, 64, 42, 42, 4], 
        [32, 64, 3, 3, 4, 4], 
        [1, 32, 1, 1, 4], 
        [1, 32, 1, 1, 4], 
        [1, 32, 42, 42, 4], 
        [1, 128, 42, 42], 
        [128, 96, 4, 4], 
        [1, 96, 1, 1], 
        [1, 96, 1, 1], 
        [1, 96, 1, 1], 
        [1, 96, 84, 84], 
        [1, 48, 84, 84, 4], 
        [24, 48, 3, 3, 4, 4], 
        [1, 24, 1, 1, 4], 
        [1, 24, 1, 1, 4], 
        [1, 24, 84, 84, 4], 
        [1, 96, 84, 84], 
        [96, 64, 4, 4], 
        [1, 64, 1, 1], 
        [1, 64, 1, 1], 
        [1, 64, 1, 1], 
        [1, 64, 168, 168], 
        [1, 32, 168, 168, 4], 
        [16, 32, 3, 3, 4, 4], 
        [1, 16, 1, 1, 4], 
        [1, 16, 1, 1, 4], 
        [1, 16, 168, 168, 4], 
        [1, 64, 168, 168], 
        [64, 48, 4, 4], 
        [1, 48, 1, 1], 
        [1, 48, 1, 1], 
        [1, 48, 1, 1], 
        [1, 48, 336, 336], 
        [1, 24, 336, 336, 4], 
        [12, 24, 3, 3, 4, 4], 
        [1, 12, 1, 1, 4], 
        [1, 12, 1, 1, 4], 
        [1, 12, 336, 336, 4], 
        [1, 48, 336, 336], 
        [48, 12, 4, 4], 
        [1, 12, 1, 1], 
        [1, 12, 672, 672], 
        [1, 5, 672, 672], 
        [1, 1, 672, 672], 
        [1, 12, 672, 672]
      ]
    ]
  }, 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    21, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27, 
    28, 
    29, 
    30, 
    31, 
    32, 
    33, 
    34, 
    35, 
    36, 
    37, 
    38, 
    39, 
    40, 
    41, 
    42, 
    43, 
    44, 
    45, 
    46, 
    47, 
    48, 
    49, 
    50, 
    51, 
    52, 
    53, 
    54, 
    55, 
    56, 
    57, 
    58, 
    59, 
    60, 
    61, 
    62, 
    63, 
    64, 
    65, 
    66, 
    67, 
    68, 
    69, 
    70, 
    71, 
    72, 
    73, 
    74, 
    75, 
    76, 
    77, 
    78, 
    79, 
    80, 
    81, 
    82, 
    83, 
    84, 
    85, 
    86, 
    87, 
    88, 
    89, 
    90, 
    91, 
    92, 
    93, 
    94, 
    95, 
    96, 
    97, 
    98, 
    99, 
    100, 
    101, 
    102, 
    103, 
    104, 
    105, 
    106, 
    107, 
    108, 
    109, 
    110, 
    111, 
    112, 
    113, 
    114, 
    115, 
    116, 
    117
  ]
}